Былков_ДА_70180166/src/Documents/ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности/ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности</name>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПродления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКонтроля</name>
    <type>
      <types>EnumRef.НаименованиеКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиваемыйСрок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриложенныеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подтверждение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРассмотрения</name>
    <type>
      <types>EnumRef.СтатусРассмотрения</types>
    </type>
  </attributes>
</mdclass:Document>

Былков_ДА_70180166/src/Documents/ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.Группа,
	|	ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.Дата,
	|	ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.Дисциплина,
	|	ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.ЗапрашиваемыйСрок,
	|	ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.НаименованиеКонтроля,
	|	ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.Номер,
	|	ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.Подтверждение,
	|	ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.ПриложенныеДокументы,
	|	ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.ПричинаПродления,
	|	ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.СтатусРассмотрения,
	|	ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.Студент
	|ИЗ
	|	Документ.ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности КАК ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности
	|ГДЕ
	|	ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
